Revit 2027 API
ParameterTypeId.StructuralSectionArea Property
 "Section Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionArea { get; }
Public Shared ReadOnly Property StructuralSectionArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionArea {
	ForgeTypeId^ get ();
}
static member StructuralSectionArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace